ObidjonovM/codes_for_mikrocontrollers/ESP_socket_3x/ESP8266_D1_mini_Socket_3x_M1_V1/src/main.cpp
#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <ESP8266HTTPClient.h>
#include <ESP8266WebServer.h>
#include <ESP_EEPROM.h>
#include <ArduinoJson.h>

/*****************************************  CONSTANTS    *******************************/

///////////////////////////////////// UNIQUE CONSTANTS FROM CLOUD //////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////
const String DEVICE_NAME = "socket_3x";               // Device name of the product
const String SERIAL_NUMBER = "001022ae5e20";          // Serial number of the product
const bool ACTIONS = true;                            // Actions of the product
const String AP_LOGIN = "FidoElectronics30";          // Access Point (AP) mode default login
/////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////
const String ROUTER_PASS = "DEFAULT";
const String PB_SERVER = "http://10.50.50.157:5000";
const String END_POINT = "/from_device";
const String SETTINGS_END_POINT = "/products/get_device_settings";
////////////////////////////////////////////////////////////////////////////////////////////////////

//////////////////////////////////// GENERAL CONSTANTS //////////////////////////////////////////////
const int MEMORY_SIZE = 512;                   // EEPROM memory size
const int OFFSET = 0;                          // Offset to start records
const String STAMP = "FIDOELECTRONICS";        // Stamp to check if the user data was recorded
const String SETTINGS_STAMP = "SETTINGS_STAMP";
const int CHANNEL = 4;                         // parameter to set Wi-Fi channel, from 1 to 13
///////////////////////////////////////////////////////////////////////////////////////////////////////

//////////////////////////////////// PIN VALUES //////////////////////////////////////////////////////
const int SAPS_BTN_PIN = 5;        // D1
const int TURN_BTN_PIN = 4;        // D2
const int LED_PIN = 0;             // D3
const int REL_PIN0 = 14;           // D5
const int REL_PIN1 = 12;           // D6
const int REL_PIN2 = 13;           // D7

/****************************************** VARIABLES *************************************/
// Authorization variables
String stamp = "";
String settingsStamp = "";
String apLogin = "";
String routerLogin = "";
String routerPass = "";
String slaveServer = "";


// HTTP related variables
int statusCode;
String httpResp;
String ssidList;
String settingsHttpResp;
bool loggedIn = false;

String relay0 = "OFF";
String relay1 = "OFF";
String relay2 = "OFF";
bool mustWriteEEPROM = false;
bool wasConnected = false;
int btnState = false;
int delayCounter = 0;
int measureDelay = 10;
int connReistTrails = 500;
int minDelay = 5;
int numDelays = 200;


ESP8266WebServer server(80);           // starting the web server

//////////////////////// HTML content functions /////////////////////////////////////
String css() {
  String content = "<style>";
  content += ".fido-electronics {";
  content += "text-align : center;";
  content += "}";

  content += ".parent-eye-icon {";
  content += "position : relative;";
  content += "}";

  content += ".list-ssid {";
  content += "line-height: 2em;";
  content += "padding: 0px 0px 20px 0px;";
  content += "font-size: 1.2em;";
  content += "}";

  content += ".hide {";
  content += "display : none;";
  content += "}";

  content += ".eye-icon {";
  content += "position : absolute;";
  content += "right : 0px;";
  content += "top : 50%;";
  content += "transform : translate(0, -50%);";
  content += "}";

  content += ".comment {";
  content += "color: red;";
  content += "font-style: italic;";
  content += "margin: 0.5em 0px;";
  content += "font-size: 1.1em;";
  content += "}";

  content += ".div-ssid {";
  content += "position : relative;";
  content += "padding: 0.3em 0.3em;";
  content += "}";

  content += ".div-ssid > :first-child {";
  content += "text-decoration: underline;";
  content += "color: blue;";
  content += "}";

  content += ".must-hover:hover {";
  content += "background-color : rgba(0,0,0, 0.05);";
  content += "cursor : pointer;";
  content += "}";

  content += ".selected-ssid {";
  content += "background-color : rgba(0,0,0, 0.2);";
  content += "}";

  content += "input[type=text], input[type=password] {";
  content += "width: 100%;";
  content += "padding: 12px 15px;";
  content += "margin: 8px 0;";
  content += "display: inline-block;";
  content += "border: 1px solid #ccc;";
  content += "box-sizing: border-box;";
  content += "}";

  content += "input[type=submit] {";
  content += "padding: 0.5em;";
  content += "cursor: pointer;";
  content += "}";

  content += ".big-button {";
  content += "padding: 0.5em;";
  content += "cursor: pointer;";
  content += "}";

  content += ".unique-form {";
  content += "background-color: rgba(0,0,0, 0.2);";
  content += "padding: 1em;";
  content += "border-radius: 3px;";
  content += "}";

  content += ".scan-button {";
  content += "width: 100%;";
  content += "padding: 0.5em;";
  content += "margin-top: 1em;";
  content += "cursor: pointer;";
  content += "border-radius: 3px;";
  content += "}";

  content += ".container {";
  content += "width: 25%;";
  content += "margin: auto;";
  content += "padding: 16px;";
  content += "border: 1px solid #ccc;";
  content += "border-radius : 3px;";
  content += "}";

  content += "@media screen and (max-width: 1400px) {";
  content += ".container {";
  content += "width:30%";
  content += "}";
  content += "}";

  content += "@media screen and (max-width: 1100px) {";
  content += ".container {";
  content += "width:40%";
  content += "}";
  content += "}";

  content += "@media screen and (max-width: 600px) {";
  content += ".container {";
  content += "width:85%";
  content += "}";
  content += "}";

  content += "</style>";
  return content;
}

