ObidjonovM/codes_for_mikrocontrollers/ESP_socket_3x/ESP8266_D1_mini_Socket_3x_M1_V1/src/main.cpp
  if (http.begin(client, url)) {
    http.addHeader("Content-Type", "application/json");
    int httpCode = http.POST(json);
    
    if (httpCode == HTTP_CODE_OK) {
      return http.getString();
    } else {
      return String(httpCode);
    }
  }
  return "-1";
}


String extractFromJSON(String respContent, String cmd) {
  int st_index = respContent.indexOf(cmd);
  if (st_index == -1) {
    return "";
  }

  st_index += cmd.length() + 1;
  char lastQuoteCmd = respContent[st_index - 1];
  st_index = respContent.indexOf("\"", st_index);
  if (st_index == -1 || String(lastQuoteCmd) != "\"") {
    return "";
  }

  int end_index = respContent.indexOf("\"", st_index + 1);
  if (end_index == -1) {
    return "";
  }
  
  return respContent.substring(st_index + 1, end_index);
}

void getFromDevice() {
  httpResp = sendRequest(slaveServer + END_POINT, 
                      "{\"device_name\":\"" + DEVICE_NAME + "\", " +
                      +"\"serial_num\":\"" + SERIAL_NUMBER + "\", " +
                      +"\"actions\":" + ACTIONS + ", " +
                      +"\"states\":{" +
                          +"\"action_states\":[" +
                            +"\"" + relay0 + "\", " +
                            +"\"" + relay1 + "\", " +
                            +"\"" + relay2 + "\"" +
                          +"]" +
                      +"}, " +
                      +"\"slave_server\":\"" + slaveServer + "\"}");
      
  startAPAndServer();
  resetbtn();

  DynamicJsonDocument doc(2048);
  deserializeJson(doc, httpResp);
  String asr0 = doc["action_states_requested"][0];
  String ast0 = doc["action_states_taken"][0];
  String asr1 = doc["action_states_requested"][1];
  String ast1 = doc["action_states_taken"][1];
  String asr2 = doc["action_states_requested"][2];
  String ast2 = doc["action_states_taken"][2];
  if (asr0 == "ON" && ast0 == "NO") {
    digitalWrite(REL_PIN0, HIGH);
    relay0 = "ON";
  }
  if (asr1 == "ON" && ast1 == "NO") {
    digitalWrite(REL_PIN1, HIGH);
    relay1 = "ON";
  }
  if (asr2 == "ON" && ast2 == "NO") {
    digitalWrite(REL_PIN2, HIGH);
    relay2 = "ON";
  }
  
  if (asr0 == "OFF" && ast0 == "NO") {
    digitalWrite(REL_PIN0, LOW);
    relay0 = "OFF";
  }
  if (asr1 == "OFF" && ast1 == "NO") {
    digitalWrite(REL_PIN1, LOW);
    relay1 = "OFF";
  }
  if (asr2 == "OFF" && ast2 == "NO") {
    digitalWrite(REL_PIN2, LOW);
    relay2 = "OFF";
  }
}

void deviceSettings(String httpResp) {
  String slave_server = extractFromJSON(httpResp, "slave_server");

  if (slave_server != "" && slave_server != slaveServer) {
    slaveServer = slave_server;
    mustWriteEEPROM = true;
  }
}

void getDeviceSettings() {
  settingsHttpResp = sendRequest(PB_SERVER + SETTINGS_END_POINT, 
                              "{\"serial_num\":\"" + SERIAL_NUMBER + "\"}");
  deviceSettings(settingsHttpResp);
}

void establishConnection(int numTrails) {
  int trailCounter = 0;
  while (WiFi.status() != WL_CONNECTED) {
    if (trailCounter < numTrails) {
      resetbtn();
      startAPAndServer();
      fidoDelay(10);
      trailCounter++;
    } else {
      break;
    }
  }
}

void loop() {
  startAPAndServer();
  if (settingsStamp == SETTINGS_STAMP) {
    resetbtn();
    if (delayCounter == numDelays) {
      delayCounter = 0;
      if (WiFi.status() == WL_CONNECTED) {
        digitalWrite(LED_PIN, HIGH);
        getFromDevice();
        if (!wasConnected) {
          getDeviceSettings();
          if (mustWriteEEPROM) {
            saveCredentials();
            mustWriteEEPROM = false;
            ESP.reset();
          }
          wasConnected = true;
        }
      } else {
        wasConnected = false;
        digitalWrite(LED_PIN, LOW);
        establishConnection(connReistTrails);
      }
      fidoDelay(measureDelay);
    }
    fidoDelay(minDelay);
    delayCounter += 1;
  } else {
    if (WiFi.status() == WL_CONNECTED) {
      getDeviceSettings();
      if (mustWriteEEPROM == true) {
        settingsStamp = SETTINGS_STAMP;
        saveCredentials();
        ESP.reset();
      }
    }
  }
}